{
    "meetups": [
      {
        "date": "Thursday, April 27, 2023 at 6:30 PM ",
        "description": "Presenters: Patryk Pilecki - https://www.linkedin.com/in/pil3q/ Wale Salami - https://www.linkedin.com/in/wale-salami/  Inspired by Wale’s time at Hashiconf last year, we will introduce principles of Infrastructure as a Code by building a “castle”(and more) in Minecraft with Terraform. In this session, you will build, write and draw in your own Minecraft map. Don’t worry you don’t need to own or know how to play the game - we will only use it as a visual representation of our Infrastructure. If you happen to own the game you can use the client to log in to the server we provide. At the end of the session, you should know:  * What are Resources and States * How and when to use variables and locals * How to create and manage resources * How to use functions and meta-arguments * How to write and use Terraform modules  No previous experience is necessary. If you are already a terraform guru - at the end of the session, we encourage everyone to build something cool - that will be your time to shine!  Agenda (in-person, stream will start at 18:30): 18:00 - Doors open, time to settle in and grab a drink! 18:30 - Start of the session 20:00 - Time for the pizza and networking 21:00 - The end  For those coming to our meet-up for the first time, we believe in learning by doing so please bring a laptop with you! The session will start with a short presentation introducing the topic and lead into a one-hour-long hands-on lab. We will provide an environment for you, so anything with the web browser from this century should be sufficient!",
        "featured": true,
        "id": "6462014d8f08bf368eede945",
        "location": "GlobalLogic – London office 2 More London Place · London",
        "presenters": ["Patryk Pilecki", "Wale Salami"],
        "title": "📁 DevOps Playground: Hands-on Intro to IaC with Terraform and Minecraft"
      },
      {
        "date": "Tuesday, March 28, 2023 at 6:30 PM",
        "description": "Presenter: Philip Walton - https://www.linkedin.com/in/phil-walton-b4449b240/  NGINX is the most popular web server with over 25% of the market share! In the words of the creators:  NGINX is open-source software for web serving, reverse proxying, caching, load balancing, media streaming, and more. It started out as a web server designed for maximum performance and stability. In addition to its HTTP server capabilities, NGINX can also function as a proxy server for email (IMAP, POP3, and SMTP) and a reverse proxy and load balancer for HTTP, TCP, and UDP servers. source: https://www.nginx.com/resources/glossary/nginx/  It is a powerful tool and due to its popularity, it is difficult to find someone from the tech industry who never heard of it!This will be an introductory-level look at some features of NGINX. In this session you will learn:  how to configure NGINX as a web-server, next, we will make it work as load-balancer then configure it as reverse-proxy to a REST API finally how to set it up as an API Gateway to multiple micro-services. At the end of this session, you should know enough about basic functionality to start exploring more complex use cases!  Agenda (in-person, stream will start at 18:30): 18:00 - Doors open, time to settle in and grab a drink! 18:30 - Start of the session 20:00 - Time for the pizza and networking 21:00 - The end  For those coming to our meet-up for the first time, we believe in learning by doing so please bring a laptop with you! The session will start with a short presentation introducing the topic and lead into a one-hour-long hands-on lab. We will provide an environment for you, so anything with the web browser from this century should be sufficient!",
        "featured": true,
        "id": "646201958f08bf368eee4bd0",
        "location": "Manchester One 53 Portland Street · Manchester",
        "presenters": ["Philip Walton"],
        "title": "📁 DevOps Playground: Intro to NGINX - serving and routing basics"
      },
      {
        "date": "Thursday, February 23, 2023 at 6:00 PM",
        "description": "Presenters: James Sandford - https://www.linkedin.com/in/byteford/ Wale Salami - https://www.linkedin.com/in/wale-salami/  Support Slack Channel (with a dedicated team to help you with any questions during the session): https://join.slack.com/t/playgroundsupport/shared_invite/zt-eovp57xv-cufxkw~jKycbA_bvJ~~Zxw Youtube link: https://youtube.com/live/sFb0r6NJQvA  Join James Sandford and Wale Salami on the 23rd of February in our London office, or online, as they walk us through building a vault plug-in using go. This will follow up nicely from the vault Playground they hosted back in October, but this time they will be diving into the internals and making their own plug-in to save and load custom secrets.  October playground: https://www.youtube.com/watch?v=u8Bi1ev6Fdk  Agenda (in-person, stream will start at 18:30): 18:00 - Doors open, time to settle in and grab a drink! 18:30 - Start of the session 20:00 - Time for the pizza and networking 21:00 - The end  For those coming to our meet-up for the first time, we believe in learning by doing so please bring a laptop with you! The session will start with a short presentation introducing the topic and lead into a one-hour-long hands-on lab. We will provide an environment for you, so anything with the web browser from this century should be sufficient!",
        "featured": true,
        "id": "646201a58f08bf368eee6737",
        "location": "GlobalLogic – London office 2 More London Place · London",
        "presenters": ["James Sandford", "Wale Salami"],
        "title": "📁 DevOps Playground: Building Hashicorp Vault plugin with GO"
      },
      {
        "date": "Thursday, May 25, 2023 at 6:00 PM",
        "description": "Presenter: Alicia Barczak - https://www.linkedin.com/in/alicia-barczak/  Join Alicia Barczak, online or in Manchester, for an introduction to React Server Components using Next.js. Participants will learn the fundamentals of React Server Components and how it can solve common problems in modern web development – such as slow loading times, poor SEO, and inefficient use of server resources.  Agenda (in-person, stream will start at 18:30): 18:00 - Doors open, time to settle in and grab a drink! 18:30 - Start of the session 20:00 - Time for the pizza and networking 21:00 - The end  For those coming to our Meet-up for the first time, we believe in learning by doing so please bring a laptop with you! The session will start with a short presentation introducing the topic and lead into a one-hour-long hands-on lab. We will provide an environment for you, so anything with a web browser from this century should be sufficient!",
        "featured": false,
        "id": "64620b308f08bf368efb7ff0",
        "location": "Manchester One 53 Portland Street · Manchester",
        "presenters": ["Alicia Barczak"],
        "title": "📁 DevOps Playground: Intro to React Server Components using Next.js"
      },
      {
        "date": "Wednesday, November 30, 2022 at 6:30 PM",
        "description": "Speakers: Matt Sellman - https://www.linkedin.com/in/matthew-sellman-2a291baa Olwen Davies - https://www.linkedin.com/in/olwen-davies-1a6a666  Testing is a crucial stage of the software development lifecycle and essential part of DevOps philosophy. This month thanks to Matt and Olwen we will learn how to do it right!  What we’ll do: We’ll be setting up a Cucumber-JVM framework from scratch, making a GET, POST, PUT and DELETE request and putting in some Cucumber data-table transforms, with this we’ll parse some JSON responses, both simple and nested JSON.  What we’ll learn out of it: You’ll learn how to set up a JVM framework, create a Cucumber table that transforms and test an open source API. You’ll also learn how to interact with JSON, both simple and nested.  Agenda (in-person, stream will start ~18:30): 18:00 - Doors open, time to settle in and grab a drink! 18:30 - Start of the session 20:00 - Time for the pizza and networking 21:00 - The end  For those coming to our Meet-Up for the first time, we believe in learning by doing, so please bring a laptop with you! The session will start with a short presentation introducing the topic and lead into a ~1hr-long hands-on lab. We will provide an environment for you, so anything with the web browser from this century should be sufficient!",
        "featured": false,
        "id": "64620b408f08bf368efb92df",
        "location": "GlobalLogic – London office 2 More London Place · London",
        "presenters": ["Matt Sellman", "Olwen Davies"],
        "title": "📁 DevOps Playground: Testing Open Source API with Cucumber"
      }
    ]
  }
  